/**
 * - Глобальна область видимості
 * - Блочна область видимості
 * - Пошук за ланцюжком областей видимості
 */
//!======================================================

//!======================================================
// let a = 15;
// const globalValue = 10;

// // console.log(globalValue); // 10

function foo() {
  let a = 20;
  for (let i = 0; i < 5; i += 1) {
    if (i === 2) {
      const x = 15;
      a = 'Hello';
    }
  }

  return a;
}

// a = foo()

//!======================================================

// // ❌ Помилка! Змінна a не доступна в цій області видимості
// console.log(a);

// for (let i = 0; i < 3; i += 1) {
//   // ❌ Помилка! Змінна a не доступна в цій області видимості
//   console.log(a);
// }
