// # Функції

// 1. Напиши функцію, яка приймає два параметри (a і b) та повертає їхню суму.

function foo(a, b) {
  return a + b;
}

// 1. Напиши функцію, яка приймає три параметри (a, b, c) і повертає максимальне з
//    них.
//!======================================================
// function getMax(a, b, c) {
//   if (a >= b && a >= c) {
//     return a;
//   } else if (b >= a && b >= c) {
//     return b;
//   } else {
//     return c;
//   }
// }

// function getMax(a, b, c) {
//   return Math.max(a, b, c);
// }
// console.log(getMax(150, 20, 30));
//!======================================================

//1 2 3 4 5 6  7  8   9
//1 1 2 3 5 8 13 21 34

// function fibba(index) {
//   if (index <= 2) {
//     return 1;
//   }

//   return fibba(index - 1) + fibba(index - 2);
// }

// console.log(fibba(6));

//!======================================================

// !5 = 1 * 2 * 3 * 4 * 5;

// !6 = 1 * 2 * 3 * 4 * 5 * 6 ;
// !6 = !5 * 6 ;

// function factorial(number) {
//   if (number <= 1) {
//     return 1;
//   }

//   return number * factorial(number - 1);
// }

// // !2 = 1 * 2

// console.log(factorial(10));

//!======================================================
// 1. Напиши функцію, яка приймає три параметри (число, мінімум і максимум) та
//    повертає true, якщо число знаходиться між мінімумом і максимумом (включно), і
//    false, якщо ні.
// function task2(number, min, max) {
//   const isValid = number >= min && number <= max;
//   return isValid;
// }

// console.log(task2(20, 10, 50));

//!======================================================
// 1. Напиши функцію, яка приймає рядок і повертає перший символ цього рядка.

function task3(str) {
  return str[0];
}

console.log(task3('Hello World'));

//!======================================================
// 1. Напиши функцію, яка приймає рядок і повертає останній символ цього рядка.
// 1. Напиши функцію, яка приймає число і повертає true, якщо число парне, і false,
//    якщо ні.
// 1. Напиши функцію яка приймає два числа. Якщо одне з чисел дорівнює нуль то
//    повернути null, в іншому випадку повернути добуток цих двох чисел.
// 1. Напиши функцію яка приймає рядок і повертає цей самий рядок але огорнутий у
//    тег div. Приклад: на вході був рядок `"Hello world"` а на виході рядок
//    `"<div>Hello world<div>"`
// 1. Напиши функцію, яка приймає рядок і повертає кількість слів у ньому (слова
//    розділені пробілами).
// 1. Напиши функцію, яка приймає рядок і повертає його довжину помножену на
//    кількість слів в цьому рядку.
// 1. Напиши функцію, яка приймає рядок і повертає кількість голосних літер у ньому
//    (a, e, i, o, u). Використовуйте метод includes та цикл.
// 1. Напиши функцію, яка приймає рядок і повертає новий рядок, де слова
//    розташовані у зворотному порядку.
// 1. Напиши функцію, яка приймає довільну кількість аргументів і повертає true,
//    якщо всі аргументи є числами, і false, якщо ні.
// 1. Напиши функцію, яка приймає довільну кількість аргументів і повертає їх
//    об'єднаними в один рядок, розділений комами.
// 1. Напиши функцію, яка приймає довільну кількість чисел і повертає їхній
//    добуток.
// 1. Напиши функцію, яка приймає довільну кількість чисел і повертає кількість
//    непарних чисел серед них.
// 1. Напиши функцію яка приймає довільну кількість рядочків і повертає той рядок
//    що є найдовшим
// 1. Напиши функцію яка приймає довільну кількість рядочків і обєднує їх в один
//    цілий рядок.
// 1. Напиши функцію яка приймає два числа. Якщо одне з чисел дорівнює нуль то
//    повернути null, в іншому випадку повернути добуток цих двох чисел.

//!======================================================

function getMax(arr) {
  let max = -Infinity;

  for (let elem of arr) {
    if (elem > max) {
      max = elem;
    }
  }

  return max;
}

console.log(getMax([1, 6, 2, 3, 78, 9, 2, 2, 12, 4, 5634]));

//!======================================================
function getMin(arr) {
  let min = Infinity;

  for (let elem of arr) {
    if (elem < min) {
      min = elem;
    }
  }

  return min;
}

// console.log(getMin([1, 6, 2, 3, 78, 9, 2, 2, 12, 4, 5634]));

//!======================================================

function getMap() {
  const arr = [];

  for (let i = 0; i < 10; i++) {
    arr.push([' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ']);
  }

  for (let y = 0; y < arr.length; y++) {
    for (let x = 0; x < arr[y].length; x++) {
      if (x < y) {
        arr[y][x] = '0';
      }
      if (x > y) {
        arr[y][x] = '1';
      }
      if (x === y) {
        arr[y][x] = '*';
      }

      if (y === arr.length - x - 1) {
        arr[y][x] = '*';
      }

      if (y === 0 || x === 0) {
        arr[y][x] = '#';
      }

      if (y === arr.length - 1 || x === arr.length - 1) {
        arr[y][x] = '#';
      }
    }
  }

  showArr(arr);
}

function showArr(arr) {
  let result = '';
  for (const item of arr) {
    result += item.join('') + '\n';
  }
  console.log(result);
}

getMap();
