/**
 * Напиши цикл for, який виводить у консоль браузера
 * числа за зростанням від a до b, але тільки якщо число кратне 5.
 */

// const a = 10;
// const b = 50;

// for (let i = a; i <= b; i += 1) {
//   if (i % 5 === 0) {
//     console.log(i);
//   }
// }

/*
 * Напиши скрипт, який підраховує суму всіх чисел,
 * які входять в діапазон чисел у змінних від min до max.
 * Наприклад, якщо min=0 и max=5, то діапазон 0-5, і в ньому два парних числа - 2 і 4, їх сума 6.
 */

const min = 5;
const max = 10;
let total = 0;

for (let i = min; i <= max; i++) {
  if (i % 2 === 0) {
    console.log(`${total} += ${i}`);
    total += i;
  }
}

console.log(total);
